<?php
//Цель домашнего задания
//Научиться применять часто используемые функции.
//
//
//
//Что входит в задание
//Задание на использование функций существования и пустоты.
//Задание на работу со строками.
//Задание на работу с массивами.
//
//
//Задание 1
//
//
//Что нужно сделать
//Выполните все задания по работе с одномерными массивами в приложенном файле 001_empty_and_isset_function.php.
//
//
//
//Советы и рекомендации
//Если у вас возникнут сложности, загляните в файл 001_empty_and_isset_function_help.php — там вы найдёте подсказки для каждого из заданий.
//
//
//
//Что оценивается
//Должны быть выполнены все задания, описанные в файле из задания 1.
//
//
//
//Задание 2
//
//
//Что нужно сделать
//Выполните все задания по работе с одномерными массивами в приложенном файле 002_strings_function.php.
//
//
//
//Советы и рекомендации
//Если у вас возникнут сложности, загляните в файл 002_strings_function_help.php — там вы найдёте подсказки для каждого из заданий.
//
//
//
//Что оценивается
//Должны быть выполнены все задания, описанные в файле из задания 2.
//
//
//
//Задание 3
//
//
//Что нужно сделать
//Выполните все задания по работе с одномерными массивами в приложенном файле 003_arrays_function.php.
//
//
//
//Советы и рекомендации
//Если у вас возникнут сложности, загляните в файл 003_arrays_function_help.php — там вы найдёте подсказки для каждого из заданий.
//
//
//
//Что оценивается
//Должны быть выполнены все задания, описанные в файле из задания 3.
//
//
//
//Критерии оценки
//Каждое задание запускается работает корректно. Ошибки при их запуске не появляются.
//Выполнены все задания на использование функций существования и пустоты.
//Выполнены все задания по работе со строками.
//Выполнены все задания по работе с массивами